package ObjectOriented.BasicFeature.Package;

public class Define {
    /*
    面向对象编程语言是对客观世界的模拟，客观世界里成员变量都是隐藏在对象内部的，外界无法直接操作和修改
    封装可以被认为是一个保护屏障，防止该类的代码和数据被其他类随意访问。
    要访问该类的数据，必须通过指定的方式。
    适当的封装可以让代码更容易理解和维护，加强了代码的安全性

    原则：将属性隐藏起来，若需访问某个属性，提供公共方法对其访问

    封装的步骤：
        1.使用private关键字来修饰成员变量
        2.对需要访问的成员变量，提供对应的一对getXxx方法、setXxx方法

    封装的操作---private关键字
        private的含义：
            1.private是一个权限修饰符，代表最小权限
            2.可以修饰成员变量和成员方法
            3.被priva修饰后的成员变量和成员方法，只在本类中才能访问

     */
}
